import React from "react";
import InfoLayout from "../info-layout";

export default function TermsConditionsPage() {
  return (
    <InfoLayout title="ข้อกำหนดและเงื่อนไข">
      <p>
        ข้อตกลงและข้อกำหนดนี้ (ต่อไปจะเรียกว่า &quot;ข้อตกลง&quot;)
        ได้รับการจัดทำด้วยความประณีตและรอบคอบเพื่อความรู้สึกของท่านในการใช้บริการของเราที่
        Virtual Park In Market ได้รับและยอมรับในข้อตกลงและข้อกำหนดนี้
        การใช้งานของท่านสำหรับ Virtual Park In Market
        รวมถึงการเข้าถึงเว็บไซต์ของเรา
        รวมถึงเว็บไซต์พาร์ทเนอร์ของเราที่ได้มีการส่งเสริมผลิตภัณฑ์หรือบริการและร้านค้าอื่น
        ๆ หรือผลิตภัณฑ์หรือบริการอื่น ๆ
        ที่ได้รับการติดตั้งหรือบริการผ่านเว็บไซต์ Virtual Park In Market
        (รวมถึงนโยบายความเป็นส่วนตัวของเรา)
        จะถือว่าท่านได้ยอมรับข้อตกลงและข้อกำหนดนี้
        ในกรณีที่ท่านไม่ยอมรับข้อตกลงและข้อกำหนดนี้หรือมีข้อแก้ไขที่ไม่ยอมรับ
        กรุณาอย่าใช้บริการของเรา
      </p>

      <h2>1. การลงทะเบียนและบัญชีผู้ใช้</h2>

      <p>
        <strong>1.1 การลงทะเบียน:</strong> เพื่อใช้บริการของ Virtual Park In
        Market ท่านจำเป็นต้องลงทะเบียนและสร้างบัญชีผู้ใช้ของท่าน
        โดยต้องกรอกข้อมูลส่วนบุคคลของท่านอย่างถูกต้องและครบถ้วน
      </p>
      <p>
        <strong>1.2 การรักษาความลับ:</strong>{" "}
        ท่านต้องรักษาความลับของบัญชีผู้ใช้ของท่านและต้องไม่ให้ข้อมูลเข้าถึงบัญชีผู้ใช้ของท่านผู้อื่นโดยไม่มีอำนาจ
      </p>
      <p>
        <strong>1.3 อีเมลและรหัสผ่าน:</strong>{" "}
        ท่านต้องรักษาความลับของอีเมลและรหัสผ่านของท่านและไม่ให้คนอื่นเข้าถึง
      </p>
      <p>
        <strong>1.4 ข้อมูลที่ต้องการ:</strong>{" "}
        เราอาจถามข้อมูลเพิ่มเติมเกี่ยวกับท่านในภายหลัง
        และท่านจะต้องให้ข้อมูลนี้อย่างถูกต้องและครบถ้วน
      </p>

      <h2>2. การใช้บริการ</h2>

      <p>
        <strong>2.1 การซื้อสินค้า:</strong> ท่านสามารถซื้อสินค้าจาก Virtual Park
        In Market ตามเงื่อนไขที่กำหนดโดยทางเรา
      </p>
      <p>
        <strong>2.2 การจ่ายเงิน:</strong>{" "}
        การจ่ายเงินจะต้องทำผ่านวิธีการชำระเงินที่เรายอมรับเท่านั้น
      </p>
      <p>
        <strong>2.3 ข้อจำกัด:</strong>{" "}
        ท่านต้องปฏิบัติตามข้อตกลงและข้อกำหนดการใช้บริการของเรา
        และไม่ประพึ่งประเวณีการใช้บริการเพื่อวัตถุประสงค์ผิดกฎหมาย นอกจากนี้
        ท่านต้องปฏิบัติตามคำแนะนำและข้อมูลเกี่ยวกับสินค้าหรือบริการของเรา
      </p>

      <h2>3. การขายสินค้าและบริการ</h2>

      <p>
        <strong>3.1 การเผยแพร่สินค้าและบริการ:</strong>{" "}
        หากท่านเป็นผู้ขายสินค้าหรือบริการบน Virtual Park In Market
        ท่านต้องปฏิบัติตามเงื่อนไขและข้อกำหนดที่เกี่ยวข้องกับการขายสินค้าและบริการบนเว็บไซต์ของเราและต้องขายสินค้าหรือสนใจขายที่ตลาดพาร์คอินเท่านั้น
      </p>

      <h2>4. ความเป็นส่วนตัว</h2>

      <p>
        <strong>4.1 นโยบายความเป็นส่วนตัว:</strong>{" "}
        การใช้ข้อมูลส่วนบุคคลของท่านจะต้องปฏิบัติตามนโยบายความเป็นส่วนตัวของเรา
      </p>

      <h2>5. การระงับและยุติบริการ</h2>

      <p>
        <strong>5.1 การระงับ:</strong>{" "}
        เราสามารถระงับบริการของท่านในกรณีที่ท่านฝ่าฝืนข้อตกลงและข้อกำหนด
        หรือในกรณีที่เราพบการกระทำที่ไม่เป็นไปตามกฎหมาย
      </p>
      <p>
        <strong>5.2 การยุติ:</strong>{" "}
        เราสามารถยุติบริการของท่านในกรณีที่เราตัดสินใจไม่ต้องการให้บริการต่อ
        โดยไม่ต้องระงับ
      </p>

      <h2>6. ความรับผิดชอบ</h2>

      <p>
        <strong>6.1 ความรับผิดชอบของเรา:</strong>{" "}
        เราจะไม่รับผิดชอบต่อความสูญเสียหรือความเสียหายที่เกิดขึ้นจากการใช้บริการของเรานอกเหนือจากกรณีที่มีความผิดขาดของเราเท่านั้น
      </p>
      <p>
        <strong>6.2 ความรับผิดชอบของท่าน:</strong>{" "}
        ท่านต้องรับผิดชอบต่อความสูญเสียหรือความเสียหายที่เกิดขึ้นจากการใช้บริการของท่าน
        และต่อการระงับบริการของเรา
      </p>

      <h2>7. ข้อตกลงและข้อกำหนดการใช้บริการอื่น ๆ</h2>

      <p>
        <strong>7.1 ข้อตกลงและข้อกำหนดการใช้บริการอื่น ๆ:</strong>{" "}
        ข้อตกลงและข้อกำหนดการใช้บริการอื่น ๆ ที่ท่านต้องปฏิบัติตาม
        เกิดความผูกพันกับท่านตามที่ระบุไว้
      </p>

      <h2>8. การเปลี่ยนแปลงและการแจ้งเตือน</h2>

      <p>
        <strong>8.1 การเปลี่ยนแปลง:</strong>{" "}
        เราอาจเปลี่ยนแปลงข้อตกลงและข้อกำหนดนี้เมื่อใดก็ได้
        โดยการประกาศบนเว็บไซต์ของเรา
        และการเปลี่ยนแปลงนั้นจะมีผลบังคับตั้งแต่วันที่ประกาศ
      </p>
      <p>
        <strong>8.2 การแจ้งเตือน:</strong>{" "}
        เราอาจส่งข้อแจ้งเตือนหรือคำแนะนำไปยังท่านผ่านทางอีเมลหรือการติดต่ออื่น ๆ
        ตามที่เราคิดว่าเหมาะสม
      </p>

      <h2>9. ข้อตกลงและข้อกำหนดสุดท้าย</h2>

      <p>
        <strong>9.1 การยกเลิกบัญชี:</strong>{" "}
        ท่านสามารถยกเลิกบัญชีผู้ใช้ของท่านได้โดยติดต่อเรา
      </p>
      <p>
        <strong>9.2 การเปลี่ยนแปลง:</strong>{" "}
        ข้อตกลงและข้อกำหนดนี้เป็นข้อตกลงและข้อกำหนดสุดท้ายระหว่างท่านและ Virtual
        Park In Market
      </p>
      <p>
        <strong>9.3 สถานที่และกฎหมาย:</strong> ข้อตกลงและข้อกำหนดนี้ถูกจัดทำภาย
      </p>
    </InfoLayout>
  );
}
