import React from "react";
import InfoLayout from "../info-layout";

export default function PrivacyPolicyPage() {
  return (
    <InfoLayout title="นโยบายความเป็นส่วนตัว">
      <h2>1. ข้อมูลส่วนบุคคล</h2>

      <h3>1.1 การเก็บข้อมูลส่วนบุคคล</h3>
      <p>
        เว็บไซต์ &quot;Virtual Park In Market&quot;
        เก็บข้อมูลส่วนบุคคลของผู้ใช้เมื่อคุณทำการสั่งซื้อสินค้าหรือให้ข้อมูลเพื่อการสมัครสมาชิก
        ข้อมูลที่เราเก็บได้รวมถึง
      </p>
      <h4>ข้อมูลที่เราเก็บจากผู้ซื้อ</h4>
      <p>เราเก็บข้อมูลต่อไปนี้จากผู้ซื้อ</p>
      <ol>
        <li>ชื่อ</li>
        <li>อีเมล</li>
        <li>เบอร์โทรศัพท์</li>
        <li>
          ข้อมูลการชำระเงิน (รายละเอียดการชำระเงินที่ไม่รวมถึงข้อมูลบัตรเครดิต)
        </li>
        <li>ข้อมูลการจัดส่งสินค้า</li>
      </ol>
      <p>
        ข้อมูลข้างต้นจะถูกใช้ในการประมวลผลคำสั่งซื้อของคุณ
        และในการติดต่อเพื่อแจ้งข้อมูลเกี่ยวกับคำสั่งซื้อของคุณ
      </p>

      <h4>ข้อมูลที่เราเก็บจากผู้ขาย</h4>
      <p>เราเก็บข้อมูลต่อไปนี้จากผู้ขาย</p>
      <ol>
        <li>รายละเอียดร้านค้า</li>
        <li>บัตรประจำตัวประชาชนพร้อมรูปถ่าย</li>
        <li>ข้อมูลบัญชีธนาคาร (ชื่อธนาคาร, เลขบัญชี)</li>
        <li>รูปภาพสมุดเงินฝาก</li>
      </ol>

      <h3>1.2 วัตถุประสงค์ในการใช้ข้อมูล</h3>
      <p>ข้อมูลที่เราเก็บจะถูกใช้เพื่อวัตถุประสงค์ต่อไปนี้</p>
      <ul>
        <li>ให้บริการสินค้าและบริการที่คุณร้องขอ</li>
        <li>การติดต่อเพื่อการสนับสนุนลูกค้า</li>
        <li>ปรับปรุงและพัฒนาเว็บไซต์ของเรา</li>
        <li>ส่งข้อมูลเกี่ยวกับสินค้าและบริการใหม่</li>
        <li>ยืนยันตัวตนคนขายที่จะขายสินค้าบนนเว็บไซต์ของเรา</li>
      </ul>

      <h3>1.3 การเปิดเผยข้อมูล</h3>
      <p>
        เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณในกรณีที่จำเป็นเพื่อรายการต่างๆ เช่น
      </p>
      <ul>
        <li>การให้ข้อมูลแก่บริษัทจัดส่งสินค้าเพื่อให้สินค้าถึงมือคุณ</li>
        <li>ในกรณีที่ต้องปฏิบัติตามกฎหมาย</li>
        <li>เพื่อความปลอดภัยของเว็บไซต์และลูกค้า</li>
      </ul>

      <h2>2. คุกกี้ (Cookies)</h2>

      <h3>2.1 คุกกี้ที่เราใช้</h3>
      <p>
        เว็บไซต์ &quot;Virtual Park In Market&quot;
        อาจใช้คุกกี้เพื่อเก็บข้อมูลเกี่ยวกับการใช้งานของคุณ
        เพื่อปรับปรุงประสิทธิภาพและประสบการณ์การใช้งานของคุณ
      </p>

      <h3>2.2 วิธีการปรับแต่งคุกกี้</h3>
      <p>
        คุณสามารถปรับแต่งการใช้คุกกี้ได้ในเบราวเซอร์ของคุณ
        โดยคุณสามารถปิดการใช้งานคุกกี้หรือตั้งค่าให้รับคุกกี้เฉพาะหากคุณต้องการ
      </p>

      <h2>3. การป้องกันข้อมูลส่วนบุคคล</h2>
      <p>
        เรามุ่งมั่นในการรักษาข้อมูลส่วนบุคคลของคุณและป้องกันการเข้าถึงข้อมูลโดยไม่มีอำนาจ
      </p>

      <h2>4. การติดต่อเรา</h2>
      <p>
        หากคุณมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวของเรา หรือถ้าคุณต้องการแก้ไข
        ปรับปรุง หรือลบข้อมูลส่วนบุคคลของคุณ โปรดติดต่อเราผ่านทางอีเมลที่
        parkin@gmail.com หรือที่หน้าติดต่อบนเว็บไซต์ของเรา.
      </p>

      <h2>5. การปรับปรุงนโยบาย</h2>
      <p>
        นโยบายความเป็นส่วนตัวนี้อาจมีการปรับปรุงและเปลี่ยนแปลงในอนาคต
        กรุณาตรวจสอบนโยบายความเป็นส่วนตัวอย่างสม่ำเสมอเพื่อทราบข้อมูลล่าสุด
      </p>
    </InfoLayout>
  );
}
