import React from "react";
import InfoLayout from "../info-layout";

export default function ShippingReturnPolicyPage() {
  return (
    <InfoLayout title="นโยบายการจัดส่งและการคืนสินค้า">
      <h2>การจัดส่งสินค้า</h2>

      <h3>1. การส่งสินค้า</h3>
      <p>
        1.1 เมื่อคุณทำการสั่งซื้อสินค้าผ่านเว็บไซต์ &quot;Virtual Park In
        Market,&quot;
        เราจะจัดส่งสินค้าไปยังที่อยู่ที่คุณระบุในขั้นตอนการสั่งซื้อ.
      </p>
      <p>
        1.2 เราจะพยายามจัดส่งสินค้าให้ถึงมือคุณให้เร็วที่สุด โดยมีปัจจัยต่าง ๆ
        เช่น สถานที่จัดส่งและเวลาในการปฏิบัติงานของบริษัทจัดส่่งสินค้า.
      </p>

      <h3>2. ค่าจัดส่ง</h3>
      <p>
        2.1 ค่าจัดส่งจะขึ้นอยู่กับประเภทของสินค้าและสถานที่จัดส่ง.
        ค่าจัดส่งจะแสดงให้คุณทราบในขั้นตอนการสั่งซื้อก่อนที่คุณจะยืนยันการสั่งซื้อ.
      </p>

      <h2>เงื่อนไขคืนสินค้า</h2>
      <p>
        3.1
        เราพยายามให้บริการที่ดีที่สุดเพื่อให้คุณพึงพอใจกับสินค้าที่คุณได้รับ.
        แต่หากคุณพบว่าสินค้ามีความชำรุดหรือไม่ตรงกับความคาดหมายในขั้นตอนการสั่งซื้อ
        โปรดดำเนินการตามขั้นตอนการคืนสินค้าดังนี้:
      </p>
      <p>
        3.2
        คุณต้องติดต่อกับร้านค้าที่ขายโดยตรงเพื่อร้องเรียนเรื่องสินค้าชำรุดหรือไม่ตรงกับความคาดหมาย
        ภายในเวลาที่ร้านค้ากำหนด.
      </p>
      <p>
        3.3 หากร้านค้าที่ขายไม่สามารถแก้ไขปัญหาหรือชดเชยคุณในกรณีที่สินค้าชำรุด
        ทาง &quot;Virtual Park In Market&quot; จะไม่รับผิดชอบค่าเสียหายใด ๆ
        ที่เกิดขึ้น และจะไม่คืนเงินหรือสินค้าให้คุณ.
      </p>

      <h2>การติดต่อ</h2>
      <p>
        4.1
        หากคุณต้องการความช่วยเหลือหรือมีคำถามเกี่ยวกับการจัดส่งหรือการคืนสินค้า
        โปรดติดต่อเราผ่านทางอีเมลที่ parkin@gmail.com
        หรือที่หน้าติดต่อบนเว็บไซต์ของเรา.
      </p>

      <h2>การปรับปรุงนโยบาย</h2>
      <p>
        เราอาจมีการปรับปรุงนโยบายการจัดส่งและการคืนสินค้านี้ในอนาคต
        กรุณาตรวจสอบนโยบายอย่างสม่ำเสมอเพื่อทราบข้อมูลล่าสุด.
      </p>
    </InfoLayout>
  );
}
